Repository: pingfangx/TranslatorX-other
Catalog: AndroidGuide/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: An animation resource can define one of two types of animations:
zh_cn: 动画资源可以定义两种类型的动画之一：

source: An animation to show more details can be achieved by either changing the layout or starting a new activity
zh_cn: 可以通过更改布局或启动新 activity 来实现显示更多细节的动画

source: An interface that allows you to create your own evaluator.
zh_cn: 允许你创建自己的求值器的接口。

source: An interface that allows you to implement your own interpolator.
zh_cn: 一个接口，可以让你实现自己的插值器。

source: An interpolated fraction maps the elapsed fraction to a new fraction that takes into account the time interpolation that is set.
zh_cn: 插值分数将经过的分数映射到一个新分数，该分数考虑了设置的时间插值。

source: An interpolator is an animation modifier defined in XML that affects the rate of change in an animation.
zh_cn: 插值器是用 XML 定义的动画修改器，它影响动画中的更改速率。

source: An interpolator is applied to an animation element with the android:interpolator attribute, the value of which is a reference to an interpolator resource.
zh_cn: 插值器通过 android:interpolator 属性应用于动画元素，其值是对插值器资源的引用。

source: An interpolator whose animation repeats for a specified number of cycles.
zh_cn: 一种插值器，其动画在指定的周期内重复。

source: An interpolator whose change bounces at the end.
zh_cn: 一种插值器，其变化在末端反弹。

source: An interpolator whose change flings forward and overshoots the last value then comes back.
zh_cn: 一种插值器，其变化向前跳并超过最后一个值，然后返回。

source: An interpolator whose change starts backward then flings forward.
zh_cn: 一种插值器，其变化开始向后，然后向前。

source: An interpolator whose change starts backward, flings forward and overshoots the target value, then finally goes back to the final value.
zh_cn: 一种插值器，其变化从后开始，向前跳并超出目标值，然后最终返回到最终值。

source: An interpolator whose rate of change is constant.
zh_cn: 一种插值器，其变化率恒定。

source: An interpolator whose rate of change starts and ends slowly but accelerates through the middle.
zh_cn: 一种插值器，其变化率开始和结束缓慢，但通过中间加速。

source: An interpolator whose rate of change starts out quickly and then decelerates.
zh_cn: 一种插值器，其变化率开始很快，然后减速。

source: An interpolator whose rate of change starts out slowly and then accelerates.
zh_cn: 一种插值器，其变化率开始缓慢，然后加速。

source: An offset horizontal alignment constraint
zh_cn: 带偏移的水平对齐约束。

source: An unusual and fundamental feature of Android is that an application process's lifetime is not directly controlled by the application itself.
zh_cn: Android 一个不寻常的和基本特征是，一个应用程序过程的生命周期 不 直接由应用程序本身来控制。

source: And for sample code, check out ActivitySceneTransitionBasic.
zh_cn: 对于示例代码，请检出 ActivitySceneTransitionBasic。

source: And for sample code, check out BasicTransition.
zh_cn: 对于示例代码，请检出 BasicTransition。

source: And that's all there is to it.
zh_cn: 这就是所有的内容了。

source: Android 7.0 (API level 24) and higher don't send the following system broadcasts:
zh_cn: Android 7.0(API 级别 24)及更高版本不发送以下系统广播：

source: Android Runtime
zh_cn: Android 运行时

source: Android also includes a set of core runtime libraries that provide most of the functionality of the Java programming language, including some Java 8 language features, that the Java API framework uses.
zh_cn: Android 还包括一组核心运行库，它们提供了 Java 编程语言的大部分功能，包括 Java API 框架使用的一些 Java 8 语言特性。

source: Android apps can send or receive broadcast messages from the Android system and other Android apps, similar to the publish-subscribe design pattern.
zh_cn: Android 应用可以发送或接收来自 Android 系统和其他 Android 应用程序的广播消息，类似于 publish-subscribe 设计模式。

source: Android comes with a set of core apps for email, SMS messaging, calendars, internet browsing, contacts, and more.
zh_cn: Android 自带了一套核心应用程序，用于电子邮件、短信、日历、互联网浏览、联系人等。

source: Android includes different animation APIs depending on what type of animation you want, so this page provides an overview of the different ways you can add motion to your UI.
zh_cn: Android 包含不同的动画 API，这取决于你想要什么类型的动画，所以这个页面提供了你可以向 UI 添加动画的不同方式的概述。

source: Android includes several Interpolator subclasses that specify various speed curves: for instance, AccelerateInterpolator tells a transformation to start slow and speed up.
zh_cn: Android 包括指定各种速度曲线几个插值器子类：例如，AccelerateInterpolator 讲述了一个变换开始缓慢然后加快。

source: Android includes the transitions framework, which enables you to easily animate changes between two view hierarchies.
zh_cn: Android 包含 transitions framework (过渡框架)，它使你能够轻松地设置两个视图层次之间的更改的动画。

source: Android is an open source, Linux-based software stack created for a wide array of devices and form factors.
zh_cn: Android 是一个开源的、基于 Linux 的软件栈，为各种各样的设备和形式因素（form factors）。

source: Android offers a sophisticated and powerful componentized model for building your UI, based on the fundamental layout classes: View and ViewGroup.
zh_cn: 基于基本的布局类： View 和 ViewGroup，安卓提供了一套精致而强大的组件化模型来构建你的 UI。

source: Android provides a couple options for animating drawables.
zh_cn: Android 提供了两个选项来设置 drawable 的动画。

source: Android provides three ways for apps to send broadcast:
zh_cn: Android 为应用程序提供了三种发送广播的方式：

source: Animate UI visibility and motion
zh_cn: 设置 UI 可见性和运动的动画

source: Animate between activities
zh_cn: 在 activity 之间设置动画

source: Animate bitmaps
zh_cn: 设置位图的动画

source: Animate drawable graphics
zh_cn: 为 drawable 图形添加动画

source: Animate layout changes
zh_cn: 设置布局更改的动画

source: Animated vector drawables can animate the attributes of the <group> and <path> elements.
zh_cn: Animated vector drawable 可以动画化 <group> 和 <path> 元素的属性。

source: Animates a specific property of an object over a specific amount of time.
zh_cn: 在特定时间内设置对象的特定属性的动画。

source: Animation built with ObjectAnimator
zh_cn: 用 ObjectAnimator 构建的动画

source: Animation built with physics-based APIs
zh_cn: 用基于物理的 API 构建的动画

source: Animation resources
zh_cn: 动画资源

source: Animations Overview
zh_cn: 动画概览

source: Animations also add a polished look to your app, which gives it a higher quality look and feel.
zh_cn: 动画还为你的应用程序添加了一个抛光的外观，这给了它一个更高质量的外观和感觉。

source: Animations and Transitions
zh_cn: 动画和过渡

source: Animations can add visual cues that notify users about what's going on in your app.
zh_cn: 动画可以添加视觉提示，通知用户你的应用程序中发生着什么。

source: Animations not based on physics—such as those built with ObjectAnimator APIs—are fairly static and have a fixed duration.
zh_cn: 不基于物理的动画，例如那些用 ObjectAnimator API 构建的动画，是相当静态的，并且有固定的持续时间。

source: Animator sets: You can group animations into logical sets that play together or sequentially or after specified delays.
zh_cn: 动画集：可以将动画分组为逻辑集，这些逻辑集可以一起播放，也可以按顺序播放，或者在指定的延迟之后播放。

source: Animators that update the UI cause extra rendering work for every frame in which the animation runs.
zh_cn: 更新 UI 的动画器会为动画运行的每一帧带来额外的渲染工作。

source: Another benefit of Lint is that it is integrated into Android Studio.
zh_cn: Lint 的另一个好处是它集成到 Android Studio 中。

source: Another disadvantage of the view animation system is that it only modified where the View was drawn, and not the actual View itself.
zh_cn: 视图动画系统的另一个缺点是，它只修改了绘制视图的位置，而没有修改实际视图本身。

source: Another very expensive operation is traversing layouts.
zh_cn: 另一个非常昂贵的操作是遍历布局。

source: Any change you make to the default margin applies only to the views you add from then on.
zh_cn: 你对默认边距所做的任何更改仅适用于你之后添加的 view。

source: Any time a view calls requestLayout(), the Android UI system needs to traverse the entire view hierarchy to find out how big each view needs to be.
zh_cn: 每当 view 调用 requestLayout() 时，Android UI 系统都需要遍历整个 view 层次结构，以找出每个 view 需要的大小。

source: Apply Custom Attributes
zh_cn: 应用自定义属性

source: Apply the retrieved attribute values to your view
zh_cn: 将获取到的属性值应用于 view

source: Apps can also send custom broadcasts, for example, to notify other apps of something that they might be interested in (for example, some new data has been downloaded).
zh_cn: 应用程序还可以发送自定义广播，例如，通知其他应用程序他们可能感兴趣的内容(例如，一些新数据已下载)。

source: Apps can receive broadcasts in two ways: through manifest-declared receivers and context-registered receivers.
zh_cn: 应用程序可以通过两种方式接收广播：通过清单声明的 (manifest-declared) 接收器和上下文注册的 (context-registered) 接收器。

source: Apps can register to receive specific broadcasts.
zh_cn: 应用程序可以注册以接收特定广播。

source: Apps included with the platform have no special status among the apps the user chooses to install.
zh_cn: 平台中包含的应用在用户选择安装的应用中没有特殊状态。

source: As Figure 2 shows, the distance traveled at the beginning and end of the animation is less than in the middle.
zh_cn: 如图 2 所示，动画的开始和结束的距离小于中间的距离。

source: As always, the super is called first.
zh_cn: 和往常一样，先调用父类方法。

source: As an example, the NotePad application demonstrates many aspects of using the Android platform.
zh_cn: 例如， NotePad application 演示了使用 Android 平台的许多方面。

source: As an optimization, these values are stored as packed integers, and you use the static methods of View.MeasureSpec to unpack the information stored in each integer.
zh_cn: 作为优化，这些值存储为压缩整数，并使用 View.MeasureSpec 的静态方法来解压缩存储在每个整数中的信息。

source: As each receiver executes in turn, it can propagate a result to the next receiver, or it can completely abort the broadcast so that it won't be passed to other receivers.
zh_cn: 当每个接收器依次执行时，它可以将结果传播到下一个接收器，或者它可以完全中止广播，这样就不会传递给其他接收器。

source: As mentioned earlier, this is the view's responsibility.
zh_cn: 如前所述，这是 view 的责任。

source: As part of the ConstraintLayout library, MotionLayout is available as a support library and is backwards-compatible to API level 14.
zh_cn: 作为 ConstraintLayout 库的一部分，MotionLayout 可用作支持库，并向后兼容 API level 14。

source: As such, it's cheap to inflate and cheap to leave in a view hierarchy.
zh_cn: 因此，它的加载成本低，离开视图层次结构的成本低。

source: As such, the system will often kill these processes in order to balance overall system resources between these empty cached processes and the underlying kernel caches.
zh_cn: 因此，系统通常会终止这些进程，以便在这些空缓存进程和底层内核缓存之间平衡整个系统资源。

source: As the Android platform evolves, it periodically changes how system broadcasts behave.
zh_cn: 随着 Android 平台的发展，它会周期性地改变系统广播的行为。

source: As usual, you call startActivity(), but pass it a bundle of options provided by ActivityOptions.makeSceneTransitionAnimation().
zh_cn: 与往常一样，可以调用 startActivity()，但是传递一个由 ActivityOptions.makeSceneTransitionAnimation() 提供的选项的 bundle。

source: As with defining a layout, an XML file is recommended because it's more readable, reusable, and swappable than hard-coding the animation.
zh_cn: 与定义布局一样，建议使用 XML 文件，因为它比硬编码动画更具可读性、可重用性和可交换性。

source: At a high level, implementing onMeasure() looks something like this:
zh_cn: 高度概括来看，实现 onMeasure() 方法看起来是这样的：

source: At a high level, you assign animators to the properties that you want to animate, such as color, position, or size and can define aspects of the animation such as interpolation and synchronization of multiple animators.
zh_cn: 在较高级别上，可以将动画指定给要设置动画的属性，例如颜色、位置或大小，还可以定义动画的各个方面，例如多个动画的插值和同步。

source: At the end of 40ms, the animation stops, and the object ends at horizontal position 40.
zh_cn: 在 40 毫秒结束时，动画停止，对象在水平位置 40 结束。

source: Attaching
zh_cn: 附加

source: Attributes are a powerful way of controlling the behavior and appearance of views, but they can only be read when the view is initialized.
zh_cn: 属性是控制 view 行为和外观的强大方法，但只能在初始化 view 时读取它们。

source: Autoconnect does not create constraints to other views in the layout.
zh_cn: Autoconnect 不会对布局中的其他 views 创建约束。

source: Autoconnect is disabled by default.
zh_cn: 默认情况下禁用 Autoconnect。

source: Automatically create constraints
zh_cn: 自动创建约束

source: Baseline alignment
zh_cn: 基线对齐

source: Basic touch-controlled motion.
zh_cn: 基本触摸控制运动。

source: Be compatible with multiple Android platforms.
zh_cn: 与多个 Android 平台兼容。

source: Be mindful of where you register and unregister the receiver, for example, if you register a receiver in onCreate(Bundle) using the activity's context, you should unregister it in onDestroy() to prevent leaking the receiver out of the activity context.
zh_cn: 注意注册和注销接收器的位置，例如，如果使用 Activity 的上下文在 onCreate(Bundle) 中注册接收器，则应在 onDestroy() 中注销接收器，以防止接收器泄漏出 Activity 上下文。

source: Be sure to unregister the receiver when you no longer need it or the context is no longer valid.
zh_cn: 当不再需要接收器或上下文不再有效时，请确保注销接收器。

source: Be sure to use the proper format for what you want ("50" for 50% relative to the parent, or "50%" for 50% relative to itself).
zh_cn: 一定要使用正确的格式来满足你的需要(“50%p”表示相对于父对象的 50%，或“50%”表示相对于自身的 50%)。

source: Because a receiver's onReceive(Context, Intent) method runs on the main thread, it should execute and return quickly.
zh_cn: 因为接收器的 onReceive(Context, Intent) 方法在主线程上运行，所以它应该快速执行并返回。

source: Because the layout performance above slows down due to a nested LinearLayout, the performance might improve by flattening the layout—make the layout shallow and wide, rather than narrow and deep.
zh_cn: 由于上述布局性能由于嵌套的 LinearLayout 而降低，因此可以通过展平布局来提高性能，使布局浅而宽，而不是窄而深。

source: Because the view animation system already defines many interpolators in android.view.animation, you can use those interpolators in the property animation system as well.
zh_cn: 由于视图动画系统已经在 android.view.animation 中定义了许多插值器，因此也可以在属性动画系统中使用这些插值器。

source: Before you can call any drawing methods, though, it's necessary to create a Paint object.
zh_cn: 但是，在调用任何绘制方法之前，必须创建 Paint 对象。

source: Beginning with Android 8.0 (API level 26), the system imposes additional restrictions on manifest-declared receivers.
zh_cn: 从 Android 8.0(API 级别 26)开始，系统对清单声明的接收者施加额外的限制。

source: Beginning with Android 9 (API level 28), The NETWORK_STATE_CHANGED_ACTION broadcast doesn't receive information about the user's location or personally identifiable data.
zh_cn: 从 Android 9(API 级别 28)开始，NETWORK_STATE_CHANGED_ACTION 广播不会接收有关用户位置或个人识别数据的信息。

source: Better debugging support, including a dedicated sampling profiler, detailed diagnostic exceptions and crash reporting, and the ability to set watchpoints to monitor specific fields
zh_cn: 更好的调试支持，包括专用的采样分析器、详细的诊断异常和崩溃报告，以及设置观察点以监视特定字段的能力

source: Beyond simply including one layout component within another layout, you might want to make the included layout visible only when it's needed, sometime after the activity is running.
zh_cn: 除了简单地将一个布局组件包含在另一个布局中之外，你可能还希望使包含的布局仅在需要时(在 activity 运行后的某个时间)可见。

source: Beyond this lesson, you can find additional related information at Canvas and Drawables.
zh_cn: 除本课程外，你还可以在 Canvas and Drawables 中找到其他相关信息。

source: Beyond this lesson, you can find additional related information at Input Events and Property Animation.
zh_cn: 除本课程外，你还可以在 Input Events 和 Property Animation 中找到其他相关信息。

source: Beyond this lesson, you can find additional, related information in Custom Components.
zh_cn: 除本课程外，你还可以在 Custom Components 中找到其他相关信息。

source: Both paths must be compatible for morphing: they must have the same number of commands and the same number of parameters for each command.
zh_cn: 这两条路径对于变形必须是兼容的：它们必须具有相同数量的命令，且每个命令的参数数量相同。

source: Broadcast receivers can't see or capture intents used to start an activity; likewise, when you broadcast an intent, you can't find or start an activity.
zh_cn: 广播接收器无法看到或捕获用于启动 activity 的 intent；同样，当你广播 intent 时，也无法找到或启动 activity。

source: Broadcasts overview
zh_cn: 广播概述

source: Build toolchains, such as Jack, compile Java sources into DEX bytecode, which can run on the Android platform.
zh_cn: 构建工具链，比如 Jack，将 Java 源代码编译成 DEX 字节码，可以在 Android 平台上运行。

source: Building on our previous example, let's have the view change colors as part of its motion, as shown in figure 2.
zh_cn: 在前面的例子的基础上，让我们让视图在其运动中改变颜色，如图 2 所示。

source: By default, all animation instructions are applied simultaneously.
zh_cn: 默认情况下，所有动画指令都同时应用。

source: By default, the space is evenly distributed between each view that's set to "match constraints," but you can assign a weight of importance to each view using the layout_constraintHorizontal_weight and layout_constraintVertical_weight attributes.
zh_cn: 默认情况下，空间均匀分布在设置为 "match constraints" 的每个 view 之间，但是你可以使用 layout_constraintHorizontal_weight 和 layout_constraintVertical_weight 属性为每个 view 分配一个重要性权重。

source: By setting the android:oneshot attribute of the list to true, it will cycle just once then stop and hold on the last frame.
zh_cn: 通过将列表的 android:oneshot 属性设置为 true，它将只循环一次，然后停止并保持最后一帧。

source: Calculate positions, dimensions, and any other values related to your view's size in onSizeChanged(), instead of recalculating them every time you draw.
zh_cn: 在 onSizeChanged() 中计算与 view 大小相关的位置，尺寸和任何其他值，而不是每次绘制时重新计算它们。

source: Call postInvalidate() after calling fling(), in order to force a redraw.
zh_cn: 在调用 fling() 之后调用 postInvalidate()，以强制重绘。

source: Call getCurrX() and getCurrY() to retrieve these values.
zh_cn: 调用 getCurrX() 和 getCurrY() 来获取这些值。

source: Call setShader() to use your LinearGradient on filled shapes.
zh_cn: 调用 setShader() 在填充的形状上使用 LinearGradient。

source: Called after a view and all of its children has been inflated from XML.
zh_cn: 在一个 View 及其所有子 view 从 XML 加载完成后被调用。

source: Called to determine the size requirements for this view and all of its children.
zh_cn: 调用以确认 view 及其子 view 所需求的尺寸大小。

source: Called when a key up event occurs.
zh_cn: 当按键弹起时调用。

source: Called when a new key event occurs.
zh_cn: 当一个新的按键事件发生时调用。

source: Called when a touch screen motion event occurs.
zh_cn: 当发生触摸屏运动事件时调用。

source: Called when a trackball motion event occurs.
zh_cn: 当轨迹球移动事件发生时调用。

source: Called when the size of this view has changed.
zh_cn: 当 view 的尺寸发生变化时调用。

source: Called when the view gains or loses focus.
zh_cn: 当 view 获得或失去焦点时调用。

source: Called when the view is attached to a window.
zh_cn: 当 view 附加到窗体上时调用。

source: Called when the view is detached from its window.
zh_cn: 当 view 从窗体上取消附加时调用。

source: Called when the view should render its content.
zh_cn: 当 view 应渲染内容时调用。

source: Called when the visibility of the window containing the view has changed.
zh_cn: 当容纳该 view 的窗体的可见性发生变化时调用。

source: Called when the window containing the view gains or loses focus.
zh_cn: 当容纳该 view 的窗体获得或失去焦点时调用。

source: Called when this view should assign a size and position to all of its children.
zh_cn: 当 view 为其所有子 view 指定大小和位置时调用。

source: Calling goAsync() in your receiver's onReceive() method and passing the BroadcastReceiver.PendingResult to a background thread.
zh_cn: 在接收器的 onReceive() 方法中调用 goAsync() 并将 BroadcastReceiver.PendingResult 传递到后台线程。

source: Calling setTarget() sets a single target object for all children of the AnimatorSet as a convenience.
zh_cn: 为了方便，调用 setTarget() 为 AnimatorSet 的所有子对象设置单个目标对象。

source: Calling this method is mandatory.
zh_cn: 调用此方法是必需的。

source: Category
zh_cn: 分类

source: Chains can be styled in one of the following ways:
zh_cn: 可以通过以下方式之一设置链的样式：

source: Change a view visibility with a circular reveal
zh_cn: 使用圆形揭露更改视图可见性

source: Change a view visibility with a crossfade
zh_cn: 使用淡入淡出度更改视图可见性

source: Change the view size with a zoom animation
zh_cn: 使用缩放动画更改视图大小

source: Change whether the shapes are filled, outlined, or both by calling setStyle().
zh_cn: 通过调用 setStyle() 来更改形状是否填充，轮廓或两者都有。

source: Changes to system broadcasts
zh_cn: 对系统广播的更改

source: Choose from the following supported types:
zh_cn: 从以下支持的类型中选择：

source: Choose your component from the Windows tab, and click Hierarchy Viewto view the layout hierarchy of the selected component.
zh_cn: 从 Windows 选项卡中选择组件，然后单击 Hierarchy View 查看选定组件的布局层次结构。

source: Class Initialization
zh_cn: 类初始化

source: Click Finish.
zh_cn: 点击 Finish。

source: Click Guidelines in the toolbar, and then click Add Vertical Barrier or Add Horizontal Barrier.
zh_cn: 在工具栏上点击 Guidelines ，然后单击 Add Vertical Barrier 或 Add Horizontal Barrier。

source: Click a constraint handle and drag it to an available anchor point.
zh_cn: 点击约束手柄，将其拖动到可用的锚点。

source: Click on a constraint anchor to delete it.
zh_cn: 点击一个约束锚将其删除。

source: Click on a constraint to select it, and then press Delete.
zh_cn: 点击一个约束，将其选中，然后按 Delete。

source: Click one of the Create a connection buttons in the Layout section of the Attributes window, as shown in figure 4.
zh_cn: 单击 Attributes 窗口的 Layout 部分中的 Create a connection 按钮 之一，如图 4 所示。

source: Click the view to select it.
zh_cn: 点击 view 选择它。

source: Colors are represented as six digit hexadecimal numbers (for example, #333333).
zh_cn: 颜色被表示为六位十六进制数(例如，#333333)。

source: Complex custom views often need to perform multiple layout calculations depending on the size and shape of their area on screen.
zh_cn: 复杂的自定义 view 通常需要根据屏幕上区域的大小和形状执行多次布局计算。

source: Compound Controls
zh_cn: 复合控制

source: Conceptual layout for an item in a ListView.
zh_cn: ListView 中项目的概念布局。

source: Conform to Android standards
zh_cn: 符合 Android 标准

source: Consider using flatter layouts such as RelativeLayout or GridLayout to improve performance.
zh_cn: 考虑使用更平坦的布局，如 RelativeLayout 或 GridLayout 来提高性能。

source: Constrain the side of a view to the corresponding edge of the layout.
zh_cn: 将 view 的边约束为布局的相应边。

source: Constrain to a barrier
zh_cn: 约束到一个屏障

source: Constrain to a guideline
zh_cn: 参考线约束

source: Constraints overview
zh_cn: Constraints 概述

source: Construct a GestureDetector by passing in an instance of a class that implements GestureDetector.OnGestureListener.
zh_cn: 通过传入实现 GestureDetector.OnGestureListener 的类的实例来构造 GestureDetector。

source: Constructors
zh_cn: 构造方法

source: Contains one or more <item> elements.
zh_cn: 包含一个或多个 <item> 元素。

source: Content and code samples on this page are subject to the licenses described in the Content License.
zh_cn: 此页上的内容和代码示例受 Content License 中描述的许可证的约束。

source: Context-registered receivers
zh_cn: 上下文注册接收器

source: Context-registered receivers receive broadcasts as long as their registering context is valid.
zh_cn: 上下文注册的接收器，只在其注册上下文有效时接收广播。

source: Control linear groups with a chain
zh_cn: 用一个链控制线性组

source: Convert a layout
zh_cn: 转换布局

source: Create Drawing Objects
zh_cn: 创建绘制对象

source: Create Physically Plausible Motion
zh_cn: 创建物理上合理的运动

source: Create a new layout
zh_cn: 创建新的布局

source: Create a re-usable layout
zh_cn: 创建可重用布局

source: Create an IntentFilter and register the receiver by calling registerReceiver(BroadcastReceiver, IntentFilter):
zh_cn: 创建 IntentFilter 并通过调用 registerReceiver(BroadcastReceiver, IntentFilter) 注册接收器：

source: Create an instance of BroadcastReceiver.
zh_cn: 创建一个 BroadcastReceiver 实例。

source: Creates an animation by modifying an object's property values over a set period of time with an Animator.
zh_cn: 使用 Animator 在时间段内修改对象的属性值来创建动画。

source: Creates an animation by performing a series of transformations on a single image with an Animation
zh_cn: 使用 animation 在单个图像上执行一系列变换产生的动画

source: Creating a View Class
zh_cn: 创建一个视图类

source: Creating a horizontal chain
zh_cn: 创建水平链

source: Creating drawing objects within your onDraw() method significantly reduces performance and can make your UI appear sluggish.
zh_cn: 在 onDraw() 方法中创建绘图对象会显着降低性能并使 UI 显得缓慢。

source: Creating objects ahead of time is an important optimization.
zh_cn: 提前创建对象是一项重要的优化。

source: Creating your own View subclasses gives you precise control over the appearance and function of a screen element.
zh_cn: 创建你自己的 View 子类可提供对一个屏幕单元外观和功能的精细控制。

source: Creation
zh_cn: 创建

source: Custom Drawing
zh_cn: 自定义绘制

source: Custom View Components
zh_cn: 自定义视图组件

source: Custom drawing can be easy or complex according to your application's needs.
zh_cn: 根据你的应用需求，可以轻松或复杂地自定义绘制。

source: Custom interpolators
zh_cn: 自定义插值器

source: Custom views should also support event listeners to communicate important events.
zh_cn: 自定义 view 还应支持事件侦听器来传递重要事件。

source: Declaring a receiver in the manifest doesn't work.
zh_cn: 在清单中声明接收者不起作用。

source: Deep layouts - Layouts with too much nesting are bad for performance.
zh_cn: 深度布局 - 嵌套过多的布局不利于性能。

source: Deferring loading resources is an important technique to use when you have complex views that your app might need in the future.
zh_cn: 延迟加载资源是一项重要的技术，当你有复杂的视图，你的应用程序可能需要在未来使用。

source: Define Custom Attributes
zh_cn: 定义自定义属性

source: Define a ViewStub
zh_cn: 定义 ViewStub

source: Define a shape by adding lines and curves to a Path object, then draw the shape using drawPath().
zh_cn: 通过将线和曲线添加到 Path 对象来定义形状，然后使用 drawPath() 绘制形状。
